{"TP73": "Gene Symbol TP73 This gene encodes a member of the p53 family of transcription factors involved in cellular responses to stress and development. It maps to a region on chromosome 1p36 that is frequently deleted in neuroblastoma and other tumors, and thought to contain multiple tumor suppressor genes. The demonstration that this gene is monoallelically expressed (likely from the maternal allele), supports the notion that it is a candidate gene for neuroblastoma. Many transcript variants resulting from alternative splicing and/or use of alternate promoters have been found for this gene, but the biological validity and the full-length nature of some variants have not been determined.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "DDOST": "Gene Symbol DDOST This gene encodes a component of the oligosaccharyltransferase complex which catalyzes the transfer of high-mannose oligosaccharides to asparagine residues on nascent polypeptides in the lumen of the rough endoplasmic reticulum. The protein complex co-purifies with ribosomes. The product of this gene is also implicated in the processing of advanced glycation endproducts (AGEs), which form from non-enzymatic reactions between sugars and proteins or lipids and are associated with aging and hyperglycemia.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "DHDDS": "Gene Symbol DHDDS The protein encoded by this gene catalyzes cis-prenyl chain elongation to produce the polyprenyl backbone of dolichol, a glycosyl carrier lipid required for the biosynthesis of several classes of glycoproteins. Mutations in this gene are associated with retinitis pigmentosa type 59. Alternatively spliced transcript variants encoding different isoforms have been described for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "ARID1A": "Gene Symbol ARID1A This gene encodes a member of the SWI/SNF family, whose members have helicase and ATPase activities and are thought to regulate transcription of certain genes by altering the chromatin structure around those genes. The encoded protein is part of the large ATP-dependent chromatin remodeling complex SNF/SWI, which is required for transcriptional activation of genes normally repressed by chromatin. It possesses at least two conserved domains that could be important for its function. First, it has a DNA-binding domain that can specifically bind an AT-rich DNA sequence known to be recognized by a SNF/SWI complex at the beta-globin locus. Second, the C-terminus of the protein can stimulate glucocorticoid receptor-dependent transcriptional activation. It is thought that the protein encoded by this gene confers specificity to the SNF/SWI complex and may recruit the complex to its targets through either protein-DNA or protein-protein interactions. Two transcript variants encoding different isoforms have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "MAP7D1": "Gene Symbol MAP7D1 Predicted to be involved in microtubule cytoskeleton organization. Located in cytosol and microtubule cytoskeleton.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "SLC6A9": "Gene Symbol SLC6A9 The amino acid glycine acts as an inhibitory neurotransmitter in the central nervous system. The protein encoded by this gene is one of two transporters that stop glycine signaling by removing it from the synaptic cleft.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "KIF2C": "Gene Symbol KIF2C This gene encodes a kinesin-like protein that functions as a microtubule-dependent molecular motor. The encoded protein can depolymerize microtubules at the plus end, thereby promoting mitotic chromosome segregation. Alternative splicing results in multiple transcript variants.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "EIF2B3": "Gene Symbol EIF2B3 The protein encoded by this gene is one of the subunits of initiation factor eIF2B, which catalyzes the exchange of eukaryotic initiation factor 2-bound GDP for GTP. It has also been found to function as a cofactor of hepatitis C virus internal ribosome entry site-mediated translation. Mutations in this gene have been associated with leukodystrophy with vanishing white matter. Alternatively spliced transcript variants encoding different isoforms have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "STIL": "Gene Symbol STIL This gene encodes a cytoplasmic protein implicated in regulation of the mitotic spindle checkpoint, a regulatory pathway that monitors chromosome segregation during cell division to ensure the proper distribution of chromosomes to daughter cells. The protein is phosphorylated in mitosis and in response to activation of the spindle checkpoint, and disappears when cells transition to G1 phase. It interacts with a mitotic regulator, and its expression is required to efficiently activate the spindle checkpoint. It is proposed to regulate Cdc2 kinase activity during spindle checkpoint arrest. Chromosomal deletions that fuse this gene and the adjacent locus commonly occur in T cell leukemias, and are thought to arise through illegitimate V-(D)-J recombination events. Multiple transcript variants encoding different isoforms have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "JUN": "Gene Symbol JUN This gene is the putative transforming gene of avian sarcoma virus 17. It encodes a protein which is highly similar to the viral protein, and which interacts directly with specific target DNA sequences to regulate gene expression. This gene is intronless and is mapped to 1p32-p31, a chromosomal region involved in both translocations and deletions in human malignancies.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "ZNF326": "Gene Symbol ZNF326 Enables RNA polymerase II complex binding activity. Involved in regulation of DNA-templated transcription, elongation and regulation of RNA splicing. Located in nucleoplasm. Part of DBIRD complex.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "PSMD4": "Gene Symbol PSMD4 The 26S proteasome is a multicatalytic proteinase complex with a highly ordered structure composed of 2 complexes, a 20S core and a 19S regulator. The 20S core is composed of 4 rings of 28 non-identical subunits; 2 rings are composed of 7 alpha subunits and 2 rings are composed of 7 beta subunits. The 19S regulator is composed of a base, which contains 6 ATPase subunits and 2 non-ATPase subunits, and a lid, which contains up to 10 non-ATPase subunits. Proteasomes are distributed throughout eukaryotic cells at a high concentration and cleave peptides in an ATP/ubiquitin-dependent process in a non-lysosomal pathway. An essential function of a modified proteasome, the immunoproteasome, is the processing of class I MHC peptides. This gene encodes one of the non-ATPase subunits of the 19S regulator lid. Pseudogenes have been identified on chromosomes 10 and 21.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "CKS1B": "Gene Symbol CKS1B CKS1B protein binds to the catalytic subunit of the cyclin dependent kinases and is essential for their biological function. The CKS1B mRNA is found to be expressed in different patterns through the cell cycle in HeLa cells, which reflects a specialized role for the encoded protein. At least two transcript variants have been identified for this gene, and it appears that only one of them encodes a protein.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "NIT1": "Gene Symbol NIT1 This gene encodes a member of the nitrilase protein family with homology to bacterial and plant nitrilases, enzymes that cleave nitriles and organic amides to the corresponding carboxylic acids plus ammonia. Multiple transcript variants encoding different isoforms have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "TOR1AIP1": "Gene Symbol TOR1AIP1 This gene encodes a type 2 integral membrane protein that binds A- and B-type lamins. The encoded protein localizes to the inner nuclear membrane and may be involved in maintaining the attachment of the nuclear membrane to the nuclear lamina during cell division. Alternate splicing results in multiple transcript variants.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "IARS2": "Gene Symbol IARS2 Aminoacyl-tRNA synthetases catalyze the aminoacylation of tRNA by their cognate amino acid. Because of their central role in linking amino acids with nucleotide triplets contained in tRNAS, aminoacyl-tRNA synthetases are thought to be among the first proteins that appeared in evolution. Two forms of isoleucine-tRNA synthetase exist, a cytoplasmic form and a mitochondrial form. This gene encodes the mitochondrial isoleucine-tRNA synthetase which belongs to the class-I aminoacyl-tRNA synthetase family.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "KIAA1804": "Gene Symbol MAP3K21 Predicted to enable protein homodimerization activity and protein kinase activity. Predicted to be involved in protein autophosphorylation and signal transduction. Predicted to be active in cytoplasm.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "FEV": "Gene Symbol FEV This gene belongs to the ETS transcription factor family. ETS family members have a highly conserved 85-amino acid ETS domain that binds purine-rich DNA sequences. The alanine-rich C-terminus of this gene indicates that it may act as a transcription repressor. This gene is exclusively expressed in neurons of the central serotonin (5-HT) system, a system implicated in the pathogeny of such psychiatric diseases as depression, anxiety, and eating disorders. In some types of Ewing tumors, this gene is fused to the Ewing sarcoma (EWS) gene following chromosome translocations.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "PDIA6": "Gene Symbol PDIA6 This gene encodes a member of the disulfide isomerase (PDI) family of endoplasmic reticulum (ER) proteins that catalyze protein folding and thiol-disulfide interchange reactions. The encoded protein has an N-terminal ER-signal sequence, two catalytically active thioredoxin (TRX) domains, a TRX-like domain, and a C-terminal ER-retention sequence. This protein inhibits the aggregation of misfolded proteins and exhibits both isomerase and chaperone activity. Alternative splicing results in multiple transcript variants encoding different isoforms.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "OST4": "Gene Symbol OST4 Involved in protein N-linked glycosylation via asparagine. Part of oligosaccharyltransferase complex.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "CAD": "Gene Symbol CAD The de novo synthesis of pyrimidine nucleotides is required for mammalian cells to proliferate. This gene encodes a trifunctional protein which is associated with the enzymatic activities of the first 3 enzymes in the 6-step pathway of pyrimidine biosynthesis: carbamoylphosphate synthetase (CPS II), aspartate transcarbamoylase, and dihydroorotase. This protein is regulated by the mitogen-activated protein kinase (MAPK) cascade, which indicates a direct link between activation of the MAPK cascade and de novo biosynthesis of pyrimidine nucleotides. Alternative splicing results in multiple transcript variants encoding different isoforms.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "EIF2B4": "Gene Symbol EIF2B4 Eukaryotic initiation factor 2B (EIF2B), which is necessary for protein synthesis, is a GTP exchange factor composed of five different subunits. The protein encoded by this gene is the fourth, or delta, subunit. Defects in this gene are a cause of leukoencephalopathy with vanishing white matter (VWM) and ovarioleukodystrophy. Multiple transcript variants encoding different isoforms have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "MAP4K3": "Gene Symbol MAP4K3 This gene encodes a member of the mitogen-activated protein kinase kinase kinase kinase family. The encoded protein activates key effectors in cell signalling, among them c-Jun. Alternatively spliced transcripts encoding multiple isoforms have been observed for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "MEIS1": "Gene Symbol MEIS1 Homeobox genes, of which the most well-characterized category is represented by the HOX genes, play a crucial role in normal development. In addition, several homeoproteins are involved in neoplasia. This gene encodes a homeobox protein belonging to the TALE ('three amino acid loop extension') family of homeodomain-containing proteins.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "HK2": "Gene Symbol HK2 Hexokinases phosphorylate glucose to produce glucose-6-phosphate, the first step in most glucose metabolism pathways. This gene encodes hexokinase 2, the predominant form found in skeletal muscle. It localizes to the outer membrane of mitochondria. Expression of this gene is insulin-responsive, and studies in rat suggest that it is involved in the increased rate of glycolysis seen in rapidly growing cancer cells.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "CNNM4": "Gene Symbol CNNM4 This gene encodes a member of the ancient conserved domain containing protein family. Members of this protein family contain a cyclin box motif and have structural similarity to the cyclins. The encoded protein may play a role in metal ion transport. Mutations in this gene are associated with Jalili syndrome which consists of cone-rod dystrophy and amelogenesis imperfecta.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "BCL2L11": "Gene Symbol BCL2L11 The protein encoded by this gene belongs to the BCL-2 protein family. BCL-2 family members form hetero- or homodimers and act as anti- or pro-apoptotic regulators that are involved in a wide variety of cellular activities. The protein encoded by this gene contains a Bcl-2 homology domain 3 (BH3). It has been shown to interact with other members of the BCL-2 protein family and to act as an apoptotic activator. The expression of this gene can be induced by nerve growth factor (NGF), as well as by the forkhead transcription factor FKHR-L1, which suggests a role of this gene in neuronal and lymphocyte apoptosis. Transgenic studies of the mouse counterpart suggested that this gene functions as an essential initiator of apoptosis in thymocyte-negative selection. Several alternatively spliced transcript variants of this gene have been identified.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "DLX2": "Gene Symbol DLX2 Many vertebrate homeo box-containing genes have been identified on the basis of their sequence similarity with Drosophila developmental genes. Members of the Dlx gene family contain a homeobox that is related to that of Distal-less (Dll), a gene expressed in the head and limbs of the developing fruit fly. The Distal-less (Dlx) family of genes comprises at least 6 different members, DLX1-DLX6. The DLX proteins are postulated to play a role in forebrain and craniofacial development. This gene is located in a tail-to-tail configuration with another member of the gene family on the long arm of chromosome 2.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "COL1A1": "Gene Symbol COL1A1 This gene encodes the pro-alpha1 chains of type I collagen whose triple helix comprises two alpha1 chains and one alpha2 chain. Type I is a fibril-forming collagen found in most connective tissues and is abundant in bone, cornea, dermis and tendon. Mutations in this gene are associated with osteogenesis imperfecta types I-IV, Ehlers-Danlos syndrome type VIIA, Ehlers-Danlos syndrome Classical type, Caffey Disease and idiopathic osteoporosis. Reciprocal translocations between chromosomes 17 and 22, where this gene and the gene for platelet-derived growth factor beta are located, are associated with a particular type of skin tumor called dermatofibrosarcoma protuberans, resulting from unregulated expression of the growth factor. Two transcripts, resulting from the use of alternate polyadenylation signals, have been identified for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "SGK1": "Gene Symbol SGK1 This gene encodes a serine/threonine protein kinase that plays an important role in cellular stress response. This kinase activates certain potassium, sodium, and chloride channels, suggesting an involvement in the regulation of processes such as cell survival, neuronal excitability, and renal sodium excretion. High levels of expression of this gene may contribute to conditions such as hypertension and diabetic nephropathy. Several alternatively spliced transcript variants encoding different isoforms have been noted for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "CDKN1C": "Gene Symbol CDKN1C This gene is imprinted, with preferential expression of the maternal allele. The encoded protein is a tight-binding, strong inhibitor of several G1 cyclin/Cdk complexes and a negative regulator of cell proliferation. Mutations in this gene are implicated in sporadic cancers and Beckwith-Wiedemann syndorome, suggesting that this gene is a tumor suppressor candidate. Three transcript variants encoding two different isoforms have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "PRDM1": "Gene Symbol PRDM1 This gene encodes a protein that acts as a repressor of beta-interferon gene expression. The protein binds specifically to the PRDI (positive regulatory domain I element) of the beta-IFN gene promoter. Transcription of this gene increases upon virus induction. Two alternatively spliced transcript variants that encode different isoforms have been reported.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "FOXF1": "Gene Symbol FOXF1 This gene belongs to the forkhead family of transcription factors which is characterized by a distinct forkhead domain. The specific function of this gene has not yet been determined; however, it may play a role in the regulation of pulmonary genes as well as embryonic development.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "SPI1": "Gene Symbol SPI1 This gene encodes an ETS-domain transcription factor that activates gene expression during myeloid and B-lymphoid cell development. The nuclear protein binds to a purine-rich sequence known as the PU-box found near the promoters of target genes, and regulates their expression in coordination with other transcription factors and cofactors. The protein can also regulate alternative splicing of target genes. Multiple transcript variants encoding different isoforms have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "TBX3": "Gene Symbol TBX3 This gene is a member of a phylogenetically conserved family of genes that share a common DNA-binding domain, the T-box. T-box genes encode transcription factors involved in the regulation of developmental processes. This protein is a transcriptional repressor and is thought to play a role in the anterior/posterior axis of the tetrapod forelimb. Mutations in this gene cause ulnar-mammary syndrome, affecting limb, apocrine gland, tooth, hair, and genital development. Alternative splicing of this gene results in three transcript variants encoding different isoforms; however, the full length nature of one variant has not been determined.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "CEBPB": "Gene Symbol CEBPB This intronless gene encodes a transcription factor that contains a basic leucine zipper (bZIP) domain. The encoded protein functions as a homodimer but can also form heterodimers with CCAAT/enhancer-binding proteins alpha, delta, and gamma. Activity of this protein is important in the regulation of genes involved in immune and inflammatory responses, among other processes. The use of alternative in-frame AUG start codons results in multiple protein isoforms, each with distinct biological functions.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "KCTD16": "Gene Symbol KCTD16 Predicted to be involved in protein homooligomerization. Predicted to act upstream of or within regulation of G protein-coupled receptor signaling pathway. Predicted to be located in cell projection. Predicted to be part of receptor complex. Predicted to be active in postsynaptic membrane and presynaptic membrane.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "SNAI1": "Gene Symbol SNAI1 The Drosophila embryonic protein snail is a zinc finger transcriptional repressor which downregulates the expression of ectodermal genes within the mesoderm. The nuclear protein encoded by this gene is structurally similar to the Drosophila snail protein, and is also thought to be critical for mesoderm formation in the developing embryo. At least two variants of a similar processed pseudogene have been found on chromosome 2.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "HSPA5": "Gene Symbol HSPA5 The protein encoded by this gene is a member of the heat shock protein 70 (HSP70) family. This protein localizes to the lumen of the endoplasmic reticulum (ER) where it operates as a typical HSP70 chaperone involved in the folding and assembly of proteins in the ER and is a master regulator of ER homeostasis. During cellular stress, as during viral infection or tumorogenesis, this protein interacts with the transmembrane stress sensor proteins PERK (protein kinase R-like endoplasmic reticulum kinase), IRE1 (inositol-requiring kinase 1), and ATF6 (activating transcription factor 6) where it acts as a repressor of the unfolded protein response (UPR) and also plays a role in cellular apoptosis and senescence. Elevated expression and atypical translocation of this protein to the cell surface has been reported in viral infections and some types of cancer cells. At the cell surface this protein may facilitate viral attachment and entry to host cells. This gene is a therapeutic target for the treatment of coronavirus diseases and chemoresistant cancers.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "CLDN6": "Gene Symbol CLDN6 Tight junctions represent one mode of cell-to-cell adhesion in epithelial or endothelial cell sheets, forming continuous seals around cells and serving as a physical barrier to prevent solutes and water from passing freely through the paracellular space. These junctions are comprised of sets of continuous networking strands in the outwardly facing cytoplasmic leaflet, with complementary grooves in the inwardly facing extracytoplasmic leaflet. This gene encodes a component of tight junction strands, which is a member of the claudin family. The protein is an integral membrane protein and is one of the entry cofactors for hepatitis C virus. The gene methylation may be involved in esophageal tumorigenesis. This gene is adjacent to another family member CLDN9 on chromosome 16.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "FOSB": "Gene Symbol FOSB The Fos gene family consists of 4 members: FOS, FOSB, FOSL1, and FOSL2. These genes encode leucine zipper proteins that can dimerize with proteins of the JUN family, thereby forming the transcription factor complex AP-1. As such, the FOS proteins have been implicated as regulators of cell proliferation, differentiation, and transformation. Alternatively spliced transcript variants encoding different isoforms have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "TSC22D1": "Gene Symbol TSC22D1 This gene encodes a member of the TSC22 domain family of leucine zipper transcription factors. The encoded protein is stimulated by transforming growth factor beta, and regulates the transcription of multiple genes including C-type natriuretic peptide. The encoded protein may play a critical role in tumor suppression through the induction of cancer cell apoptosis, and a single nucleotide polymorphism in the promoter of this gene has been associated with diabetic nephropathy. Alternatively spliced transcript variants encoding multiple isoforms have been observed for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "CDKN1A": "Gene Symbol CDKN1A This gene encodes a potent cyclin-dependent kinase inhibitor. The encoded protein binds to and inhibits the activity of cyclin-cyclin-dependent kinase2 or -cyclin-dependent kinase4 complexes, and thus functions as a regulator of cell cycle progression at G1. The expression of this gene is tightly controlled by the tumor suppressor protein p53, through which this protein mediates the p53-dependent cell cycle G1 phase arrest in response to a variety of stress stimuli. This protein can interact with proliferating cell nuclear antigen, a DNA polymerase accessory factor, and plays a regulatory role in S phase DNA replication and DNA damage repair. This protein was reported to be specifically cleaved by CASP3-like caspases, which thus leads to a dramatic activation of cyclin-dependent kinase2, and may be instrumental in the execution of apoptosis following caspase activation. Mice that lack this gene have the ability to regenerate damaged or missing tissue. Multiple alternatively spliced variants have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "TMSB4X": "Gene Symbol TMSB4X This gene encodes an actin sequestering protein which plays a role in regulation of actin polymerization. The protein is also involved in cell proliferation, migration, and differentiation. This gene escapes X inactivation and has a homolog on chromosome Y.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "SOCS1": "Gene Symbol SOCS1 This gene encodes a member of the STAT-induced STAT inhibitor (SSI), also known as suppressor of cytokine signaling (SOCS), family. SSI family members are cytokine-inducible negative regulators of cytokine signaling. The expression of this gene can be induced by a subset of cytokines, including IL2, IL3 erythropoietin (EPO), CSF2/GM-CSF, and interferon (IFN)-gamma. The protein encoded by this gene functions downstream of cytokine receptors, and takes part in a negative feedback loop to attenuate cytokine signaling. Knockout studies in mice suggested the role of this gene as a modulator of IFN-gamma action, which is required for normal postnatal growth and survival.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "DDIT3": "Gene Symbol DDIT3 This gene encodes a member of the CCAAT/enhancer-binding protein (C/EBP) family of transcription factors. The protein functions as a dominant-negative inhibitor by forming heterodimers with other C/EBP members, such as C/EBP and LAP (liver activator protein), and preventing their DNA binding activity. The protein is implicated in adipogenesis and erythropoiesis, is activated by endoplasmic reticulum stress, and promotes apoptosis. Fusion of this gene and FUS on chromosome 16 or EWSR1 on chromosome 22 induced by translocation generates chimeric proteins in myxoid liposarcomas or Ewing sarcoma. Multiple alternatively spliced transcript variants encoding two isoforms with different length have been identified.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "TBX2": "Gene Symbol TBX2 This gene is a member of a phylogenetically conserved family of genes that share a common DNA-binding domain, the T-box. T-box genes encode transcription factors involved in the regulation of developmental processes. This gene product is the human homolog of mouse Tbx2, and shares strong sequence similarity with Drosophila omb protein. Expression studies indicate that this gene may have a potential role in tumorigenesis as an immortalizing agent. Transcript heterogeneity due to alternative polyadenylation has been noted for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "EGR1": "Gene Symbol EGR1 The protein encoded by this gene belongs to the EGR family of C2H2-type zinc-finger proteins. It is a nuclear protein and functions as a transcriptional regulator. The products of target genes it activates are required for differentitation and mitogenesis. Studies suggest this is a cancer suppressor gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "IER5L": "Gene Symbol IER5L\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "SLC38A2": "Gene Symbol SLC38A2 Enables neutral amino acid:sodium symporter activity. Involved in several processes, including amino acid transport; cellular response to arsenite(3-); and positive regulation of RNA splicing. Located in cytoplasm and plasma membrane.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "ETS2": "Gene Symbol ETS2 This gene encodes a transcription factor which regulates genes involved in development and apoptosis. The encoded protein is also a protooncogene and shown to be involved in regulation of telomerase. A pseudogene of this gene is located on the X chromosome. Alternative splicing results in multiple transcript variants.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "AURKB": "Gene Symbol AURKB This gene encodes a member of the aurora kinase subfamily of serine/threonine kinases. The genes encoding the other two members of this subfamily are located on chromosomes 19 and 20. These kinases participate in the regulation of alignment and segregation of chromosomes during mitosis and meiosis through association with microtubules. A pseudogene of this gene is located on chromosome 8. Alternatively spliced transcript variants have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "CENPE": "Gene Symbol CENPE Centrosome-associated protein E (CENPE) is a kinesin-like motor protein that accumulates in the G2 phase of the cell cycle. Unlike other centrosome-associated proteins, it is not present during interphase and first appears at the centromere region of chromosomes during prometaphase. This protein is required for stable spindle microtubule capture at kinetochores which is a necessary step in chromosome alignment during prometaphase. This protein also couples chromosome position to microtubule depolymerizing activity. Alternative splicing results in multiple transcript variants encoding distinct protein isoforms.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "BHLHE40": "Gene Symbol BHLHE40 This gene encodes a basic helix-loop-helix protein expressed in various tissues. The encoded protein can interact with ARNTL or compete for E-box binding sites in the promoter of PER1 and repress CLOCK/ARNTL's transactivation of PER1. This gene is believed to be involved in the control of circadian rhythm and cell differentiation.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "OSR2": "Gene Symbol OSR2\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "UBASH3B": "Gene Symbol UBASH3B This gene encodes a protein that contains a ubiquitin associated domain at the N-terminus, an SH3 domain, and a C-terminal domain with similarities to the catalytic motif of phosphoglycerate mutase. The encoded protein was found to inhibit endocytosis of epidermal growth factor receptor (EGFR) and platelet-derived growth factor receptor.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "ARRDC3": "Gene Symbol ARRDC3 This gene encodes a member of the arrestin family of proteins, which regulate G protein-mediated signaling. The encoded protein is thought to act as a regulator of breast cancer growth and progression by binding to a phosphorylated form of integrin beta4, a tumor-related antigen, targeting the integrin for internalization and degradation.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "IKZF3": "Gene Symbol IKZF3 This gene encodes a member of the Ikaros family of zinc-finger proteins. Three members of this protein family (Ikaros, Aiolos and Helios) are hematopoietic-specific transcription factors involved in the regulation of lymphocyte development. This gene product is a transcription factor that is important in the regulation of B lymphocyte proliferation and differentiation. Both Ikaros and Aiolos can participate in chromatin remodeling. Regulation of gene expression in B lymphocytes by Aiolos is complex as it appears to require the sequential formation of Ikaros homodimers, Ikaros/Aiolos heterodimers, and Aiolos homodimers. Several alternative transcripts encoding different isoforms have been described, as well as some non-protein coding variants.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "LYL1": "Gene Symbol LYL1 This gene represents a basic helix-loop-helix transcription factor. The encoded protein may play roles in blood vessel maturation and hematopoeisis. A translocation between this locus and the T cell receptor beta locus (GeneID 6957) on chromosome 7 has been associated with acute lymphoblastic leukemia.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "TGFBR2": "Gene Symbol TGFBR2 The protein encoded by this gene is a transmembrane protein that has a protein kinase domain, forms a heterodimeric complex with TGF-beta receptor type-1, and binds TGF-beta. This receptor/ligand complex phosphorylates proteins, which then enter the nucleus and regulate the transcription of genes related to cell proliferation, cell cycle arrest, wound healing, immunosuppression, and tumorigenesis. Mutations in this gene have been associated with Marfan Syndrome, Loeys-Deitz Aortic Aneurysm Syndrome, and the development of various types of tumors. Alternatively spliced transcript variants encoding different isoforms have been characterized.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "CIT": "Gene Symbol CIT This gene encodes a serine/threonine-protein kinase that functions in cell division. Together with the kinesin KIF14, this protein localizes to the central spindle and midbody, and functions to promote efficient cytokinesis. This protein is involved in central nervous system development. Polymorphisms in this gene are associated with bipolar disorder and risk for schizophrenia. Alternative splicing results in multiple transcript variants.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "AHR": "Gene Symbol AHR The protein encoded by this gene is a ligand-activated helix-loop-helix transcription factor involved in the regulation of biological responses to planar aromatic hydrocarbons. This receptor has been shown to regulate xenobiotic-metabolizing enzymes such as cytochrome P450. Before ligand binding, the encoded protein is sequestered in the cytoplasm; upon ligand binding, this protein moves to the nucleus and stimulates transcription of target genes.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "OGG1": "Gene Symbol OGG1 This gene encodes the enzyme responsible for the excision of 8-oxoguanine, a mutagenic base byproduct which occurs as a result of exposure to reactive oxygen. The action of this enzyme includes lyase activity for chain cleavage. Alternative splicing of the C-terminal region of this gene classifies splice variants into two major groups, type 1 and type 2, depending on the last exon of the sequence. Type 1 alternative splice variants end with exon 7 and type 2 end with exon 8. All variants share the N-terminal region in common, which contains a mitochondrial targeting signal that is essential for mitochondrial localization. Many alternative splice variants for this gene have been described, but the full-length nature for every variant has not been determined.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "CNN1": "Gene Symbol CNN1 Predicted to enable actin binding activity. Involved in negative regulation of vascular associated smooth muscle cell proliferation. Located in cytoskeleton.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "ZBTB25": "Gene Symbol ZBTB25 Predicted to enable DNA-binding transcription repressor activity, RNA polymerase II-specific and RNA polymerase II cis-regulatory region sequence-specific DNA binding activity. Predicted to be involved in regulation of transcription by RNA polymerase II. Located in nucleoplasm.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "TTI2": "Gene Symbol TTI2 This gene encodes a regulator of the DNA damage response. The protein is a component of the Triple T complex (TTT) which also includes telomere length regulation protein and TELO2 interacting protein 1. The TTT complex is involved in cellular resistance to DNA damage stresses and may act as a regulator of phosphoinositide-3-kinase-related protein kinase (PIKK) abundance.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "IRF1": "Gene Symbol IRF1 The protein encoded by this gene is a transcriptional regulator and tumor suppressor, serving as an activator of genes involved in both innate and acquired immune responses. The encoded protein activates the transcription of genes involved in the body's response to viruses and bacteria, playing a role in cell proliferation, apoptosis, the immune response, and DNA damage response. This protein represses the transcription of several other genes. As a tumor suppressor, it both suppresses tumor cell growth and stimulates an immune response against tumor cells. Defects in this gene have been associated with gastric cancer, myelogenous leukemia, and lung cancer.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "AURKA": "Gene Symbol AURKA The protein encoded by this gene is a cell cycle-regulated kinase that appears to be involved in microtubule formation and/or stabilization at the spindle pole during chromosome segregation. The encoded protein is found at the centrosome in interphase cells and at the spindle poles in mitosis. This gene may play a role in tumor development and progression. A processed pseudogene of this gene has been found on chromosome 1, and an unprocessed pseudogene has been found on chromosome 10. Multiple transcript variants encoding the same protein have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "PLK4": "Gene Symbol PLK4 This gene encodes a member of the polo family of serine/threonine protein kinases. The protein localizes to centrioles, complex microtubule-based structures found in centrosomes, and regulates centriole duplication during the cell cycle. Three alternatively spliced transcript variants that encode different protein isoforms have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "HSD17B12": "Gene Symbol HSD17B12 This gene encodes a very important 17beta-hydroxysteroid dehydrogenase (17beta-HSD) that converts estrone into estradiol in ovarian tissue. This enzyme is also involved in fatty acid elongation.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "FOXA3": "Gene Symbol FOXA3 This gene encodes a member of the forkhead class of DNA-binding proteins. These hepatocyte nuclear factors are transcriptional activators for liver-specific transcripts such as albumin and transthyretin, and they also interact with chromatin. Similar family members in mice have roles in the regulation of metabolism and in the differentiation of the pancreas and liver. The crystal structure of a similar protein in rat has been resolved.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "CEBPA": "Gene Symbol CEBPA This intronless gene encodes a transcription factor that contains a basic leucine zipper (bZIP) domain and recognizes the CCAAT motif in the promoters of target genes. The encoded protein functions in homodimers and also heterodimers with CCAAT/enhancer-binding proteins beta and gamma. Activity of this protein can modulate the expression of genes involved in cell cycle regulation as well as in body weight homeostasis. Mutation of this gene is associated with acute myeloid leukemia. The use of alternative in-frame non-AUG (GUG) and AUG start codons results in protein isoforms with different lengths. Differential translation initiation is mediated by an out-of-frame, upstream open reading frame which is located between the GUG and the first AUG start codons.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "HES7": "Gene Symbol HES7 This gene encodes a member of the hairy and enhancer of split family of bHLH transcription factors. The mouse ortholog of this gene is regulated by Notch signaling. The protein functions as a transcriptional repressor, and is implicated in correct patterning of the axial skeleton. A mutation in this gene has been shown to result in spondylocostal dysostosis. Multiple transcript variants encoding different isoforms have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "AARS": "Gene Symbol AARS1 The human alanyl-tRNA synthetase (AARS) belongs to a family of tRNA synthases, of the class II enzymes. Class II tRNA synthases evolved early in evolution and are highly conserved. This is reflected by the fact that 498 of the 968-residue polypeptide human AARS shares 41% identity witht the E.coli protein. tRNA synthases are the enzymes that interpret the RNA code and attach specific aminoacids to the tRNAs that contain the cognate trinucleotide anticodons. They consist of a catalytic domain which interacts with the amino acid acceptor-T psi C helix of the tRNA, and a second domain which interacts with the rest of the tRNA structure.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "BAK1": "Gene Symbol BAK1 The protein encoded by this gene belongs to the BCL2 protein family. BCL2 family members form oligomers or heterodimers and act as anti- or pro-apoptotic regulators that are involved in a wide variety of cellular activities. This protein localizes to mitochondria, and functions to induce apoptosis. It interacts with and accelerates the opening of the mitochondrial voltage-dependent anion channel, which leads to a loss in membrane potential and the release of cytochrome c. This protein also interacts with the tumor suppressor P53 after exposure to cell stress.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "BCORL1": "Gene Symbol BCORL1 The protein encoded by this gene is a transcriptional corepressor that is found tethered to promoter regions by DNA-binding proteins. The encoded protein can interact with several different class II histone deacetylases to repress transcription. Two transcript variants encoding different isoforms have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "C19orf26": "Gene Symbol CBARP Predicted to enable transmembrane transporter binding activity. Predicted to be involved in negative regulation of calcium ion-dependent exocytosis and negative regulation of voltage-gated calcium channel activity. Predicted to be located in synaptic vesicle membrane. Predicted to be integral component of membrane. Predicted to be active in plasma membrane. Predicted to colocalize with growth cone and secretory granule.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "CEBPE": "Gene Symbol CEBPE The protein encoded by this gene is a bZIP transcription factor which can bind as a homodimer to certain DNA regulatory regions. It can also form heterodimers with the related protein CEBP-delta. The encoded protein may be essential for terminal differentiation and functional maturation of committed granulocyte progenitor cells. Mutations in this gene have been associated with Specific Granule Deficiency, a rare congenital disorder. Multiple variants of this gene have been described, but the full-length nature of only one has been determined.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "CELF2": "Gene Symbol CELF2 Members of the CELF/BRUNOL protein family contain two N-terminal RNA recognition motif (RRM) domains, one C-terminal RRM domain, and a divergent segment of 160-230 aa between the second and third RRM domains. Members of this protein family regulate pre-mRNA alternative splicing and may also be involved in mRNA editing, and translation. Alternative splicing results in multiple transcript variants encoding different isoforms.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "CHERP": "Gene Symbol CHERP Enables transmembrane transporter binding activity. Involved in positive regulation of calcineurin-NFAT signaling cascade and release of sequestered calcium ion into cytosol. Acts upstream of or within cellular calcium ion homeostasis and negative regulation of cell population proliferation. Located in perinuclear region of cytoplasm.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "DERL2": "Gene Symbol DERL2\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "FECH": "Gene Symbol FECH The protein encoded by this gene is localized to the mitochondrion, where it catalyzes the insertion of the ferrous form of iron into protoporphyrin IX in the heme synthesis pathway. Mutations in this gene are associated with erythropoietic protoporphyria. Two transcript variants encoding different isoforms have been found for this gene. A pseudogene of this gene is found on chromosome 3.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "MAP2K3": "Gene Symbol MAP2K3 The protein encoded by this gene is a dual specificity protein kinase that belongs to the MAP kinase kinase family. This kinase is activated by mitogenic and environmental stress, and participates in the MAP kinase-mediated signaling cascade. It phosphorylates and thus activates MAPK14/p38-MAPK. This kinase can be activated by insulin, and is necessary for the expression of glucose transporter. Expression of RAS oncogene is found to result in the accumulation of the active form of this kinase, which thus leads to the constitutive activation of MAPK14, and confers oncogenic transformation of primary cells. The inhibition of this kinase is involved in the pathogenesis of Yersina pseudotuberculosis. Multiple alternatively spliced transcript variants that encode distinct isoforms have been reported for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "MAP4K5": "Gene Symbol MAP4K5 This gene encodes a member of the serine/threonine protein kinase family, that is highly similar to yeast SPS1/STE20 kinase. Yeast SPS1/STE20 functions near the beginning of the MAP kinase signal cascades that is essential for yeast pheromone response. This kinase was shown to activate Jun kinase in mammalian cells, which suggested a role in stress response. Two alternatively spliced transcript variants encoding the same protein have been described for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "MAPK1": "Gene Symbol MAPK1 This gene encodes a member of the MAP kinase family. MAP kinases, also known as extracellular signal-regulated kinases (ERKs), act as an integration point for multiple biochemical signals, and are involved in a wide variety of cellular processes such as proliferation, differentiation, transcription regulation and development. The activation of this kinase requires its phosphorylation by upstream kinases. Upon activation, this kinase translocates to the nucleus of the stimulated cells, where it phosphorylates nuclear targets. One study also suggests that this protein acts as a transcriptional repressor independent of its kinase activity. The encoded protein has been identified as a moonlighting protein based on its ability to perform mechanistically distinct functions. Two alternatively spliced transcript variants encoding the same protein, but differing in the UTRs, have been reported for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "RUNX1T1": "Gene Symbol RUNX1T1 This gene encodes a member of the myeloid translocation gene family which interact with DNA-bound transcription factors and recruit a range of corepressors to facilitate transcriptional repression. The t(8;21)(q22;q22) translocation is one of the most frequent karyotypic abnormalities in acute myeloid leukemia. The translocation produces a chimeric gene made up of the 5'-region of the runt-related transcription factor 1 gene fused to the 3'-region of this gene. The chimeric protein is thought to associate with the nuclear corepressor/histone deacetylase complex to block hematopoietic differentiation. Alternative splicing results in multiple transcript variants.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "SARS": "Gene Symbol SARS1 This gene belongs to the class II amino-acyl tRNA family. The encoded enzyme catalyzes the transfer of L-serine to tRNA (Ser) and is related to bacterial and yeast counterparts. Multiple alternatively spliced transcript variants have been described but the biological validity of all variants is unknown.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "SEC61A1": "Gene Symbol SEC61A1 The protein encoded by this gene belongs to the SECY/SEC61- alpha family. It appears to play a crucial role in the insertion of secretory and membrane polypeptides into the endoplasmic reticulum. This protein found to be tightly associated with membrane-bound ribosomes, either directly or through adaptor proteins. This gene encodes an alpha subunit of the heteromeric SEC61 complex, which also contains beta and gamma subunits.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "SEC63": "Gene Symbol SEC63 The Sec61 complex is the central component of the protein translocation apparatus of the endoplasmic reticulum (ER) membrane. The protein encoded by this gene and SEC62 protein are found to be associated with ribosome-free SEC61 complex. It is speculated that Sec61-Sec62-Sec63 may perform post-translational protein translocation into the ER. The Sec61-Sec62-Sec63 complex might also perform the backward transport of ER proteins that are subject to the ubiquitin-proteasome-dependent degradation pathway. The encoded protein is an integral membrane protein located in the rough ER.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "SEL1L": "Gene Symbol SEL1L The protein encoded by this gene is part of a protein complex required for the retrotranslocation or dislocation of misfolded proteins from the endoplasmic reticulum lumen to the cytosol, where they are degraded by the proteasome in a ubiquitin-dependent manner. Alternatively spliced transcript variants encoding different isoforms have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "SLC4A1": "Gene Symbol SLC4A1 The protein encoded by this gene is part of the anion exchanger (AE) family and is expressed in the erythrocyte plasma membrane, where it functions as a chloride/bicarbonate exchanger involved in carbon dioxide transport from tissues to lungs. The protein comprises two domains that are structurally and functionally distinct. The N-terminal 40kDa domain is located in the cytoplasm and acts as an attachment site for the red cell skeleton by binding ankyrin. The glycosylated C-terminal membrane-associated domain contains 12-14 membrane spanning segments and carries out the stilbene disulphonate-sensitive exchange transport of anions. The cytoplasmic tail at the extreme C-terminus of the membrane domain binds carbonic anhydrase II. The encoded protein associates with the red cell membrane protein glycophorin A and this association promotes the correct folding and translocation of the exchanger. This protein is predominantly dimeric but forms tetramers in the presence of ankyrin. Many mutations in this gene are known in man, and these mutations can lead to two types of disease: destabilization of red cell membrane leading to hereditary spherocytosis, and defective kidney acid secretion leading to distal renal tubular acidosis. Other mutations that do not give rise to disease result in novel blood group antigens, which form the Diego blood group system. Southeast Asian ovalocytosis (SAO, Melanesian ovalocytosis) results from the heterozygous presence of a deletion in the encoded protein and is common in areas where Plasmodium falciparum malaria is endemic. One null mutation in this gene is known, resulting in very severe anemia and nephrocalcinosis.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "TMED2": "Gene Symbol TMED2 Involved in several processes, including Golgi organization; negative regulation of GTPase activity; and protein localization to plasma membrane. Located in Golgi apparatus; endoplasmic reticulum; and endoplasmic reticulum-Golgi intermediate compartment.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "UFL1": "Gene Symbol UFL1 Enables UFM1 ligase activity and protein kinase binding activity. Involved in several processes, including cellular protein modification process; regulation of signal transduction; and reticulophagy. Acts upstream of or within several processes, including positive regulation of cell population proliferation; regulation of proteasomal ubiquitin-dependent protein catabolic process; and response to endoplasmic reticulum stress. Located in endoplasmic reticulum membrane; nucleus; and site of double-strand break. Part of protein-containing complex.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "AMIGO3": "Gene Symbol AMIGO3 Predicted to be involved in brain development and heterophilic cell-cell adhesion via plasma membrane cell adhesion molecules. Predicted to act upstream of or within positive regulation of synapse assembly. Predicted to be integral component of membrane.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "ARHGAP22": "Gene Symbol ARHGAP22 This gene encodes a member of the GTPase activating protein family which activates a GTPase belonging to the RAS superfamily of small GTP-binding proteins. The encoded protein is insulin-responsive, is dependent on the kinase Akt and requires the Akt-dependent 14-3-3 binding protein which binds sequentially to two serine residues. The result of these interactions is regulation of cell motility. Multiple transcript variants encoding different isoforms have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "ASCC3": "Gene Symbol ASCC3 This gene encodes a protein that belongs to a family of helicases that are involved in the ATP-dependent unwinding of nucleic acid duplexes. The encoded protein is the largest subunit of the activating signal cointegrator 1 complex that is involved in DNA repair and resistance to alkylation damage. Alternate splicing results in multiple transcript variants.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "ATL1": "Gene Symbol ATL1 The protein encoded by this gene is a GTPase and a Golgi body transmembrane protein. The encoded protein can form a homotetramer and has been shown to interact with spastin and with mitogen-activated protein kinase kinase kinase kinase 4. This protein may be involved in axonal maintenance as evidenced by the fact that defects in this gene are a cause of spastic paraplegia type 3. Three transcript variants encoding two different isoforms have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "ATP5B": "Gene Symbol ATP5F1B This gene encodes a subunit of mitochondrial ATP synthase. Mitochondrial ATP synthase catalyzes ATP synthesis, utilizing an electrochemical gradient of protons across the inner membrane during oxidative phosphorylation. ATP synthase is composed of two linked multi-subunit complexes: the soluble catalytic core, F1, and the membrane-spanning component, Fo, comprising the proton channel. The catalytic portion of mitochondrial ATP synthase consists of 5 different subunits (alpha, beta, gamma, delta, and epsilon) assembled with a stoichiometry of 3 alpha, 3 beta, and a single representative of the other 3. The proton channel consists of three main subunits (a, b, c). This gene encodes the beta subunit of the catalytic core.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "AURKC": "Gene Symbol AURKC This gene encodes a member of the Aurora subfamily of serine/threonine protein kinases. The encoded protein is a chromosomal passenger protein that forms complexes with Aurora-B and inner centromere proteins and may play a role in organizing microtubules in relation to centrosome/spindle function during mitosis. This gene is overexpressed in several cancer cell lines, suggesting an involvement in oncogenic signal transduction. Alternative splicing results in multiple transcript variants.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "BPGM": "Gene Symbol BPGM 2,3-diphosphoglycerate (2,3-DPG) is a small molecule found at high concentrations in red blood cells where it binds to and decreases the oxygen affinity of hemoglobin. This gene encodes a multifunctional enzyme that catalyzes 2,3-DPG synthesis via its synthetase activity, and 2,3-DPG degradation via its phosphatase activity. The enzyme also has phosphoglycerate phosphomutase activity. Deficiency of this enzyme increases the affinity of cells for oxygen. Mutations in this gene result in hemolytic anemia. Multiple alternatively spliced variants, encoding the same protein, have been identified.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "CARS": "Gene Symbol CARS1 This gene encodes a class 1 aminoacyl-tRNA synthetase, cysteinyl-tRNA synthetase. Each of the twenty aminoacyl-tRNA synthetases catalyzes the aminoacylation of a specific tRNA or tRNA isoaccepting family with the cognate amino acid. This gene is one of several located near the imprinted gene domain on chromosome 11p15.5, an important tumor-suppressor gene region. Alterations in this region have been associated with Beckwith-Wiedemann syndrome, Wilms tumor, rhabdomyosarcoma, adrenocortical carcinoma, and lung, ovarian and breast cancers. Alternative splicing of this gene results in multiple transcript variants.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "CBFA2T3": "Gene Symbol CBFA2T3 This gene encodes a member of the myeloid translocation gene family which interact with DNA-bound transcription factors and recruit a range of corepressors to facilitate transcriptional repression. The t(16;21)(q24;q22) translocation is one of the less common karyotypic abnormalities in acute myeloid leukemia. The translocation produces a chimeric gene made up of the 5'-region of the runt-related transcription factor 1 gene fused to the 3'-region of this gene. This gene is also a putative breast tumor suppressor. Alternative splicing results in transcript variants.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "CBL": "Gene Symbol CBL This gene is a proto-oncogene that encodes a RING finger E3 ubiquitin ligase. The encoded protein is one of the enzymes required for targeting substrates for degradation by the proteasome. This protein mediates the transfer of ubiquitin from ubiquitin conjugating enzymes (E2) to specific substrates. This protein also contains an N-terminal phosphotyrosine binding domain that allows it to interact with numerous tyrosine-phosphorylated substrates and target them for proteasome degradation. As such it functions as a negative regulator of many signal transduction pathways. This gene has been found to be mutated or translocated in many cancers including acute myeloid leukaemia, and expansion of CGG repeats in the 5' UTR has been associated with Jacobsen syndrome. Mutations in this gene are also the cause of Noonan syndrome-like disorder.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "CCND3": "Gene Symbol CCND3 The protein encoded by this gene belongs to the highly conserved cyclin family, whose members are characterized by a dramatic periodicity in protein abundance through the cell cycle. Cyclins function as regulators of CDK kinases. Different cyclins exhibit distinct expression and degradation patterns which contribute to the temporal coordination of each mitotic event. This cyclin forms a complex with and functions as a regulatory subunit of CDK4 or CDK6, whose activtiy is required for cell cycle G1/S transition. This protein has been shown to interact with and be involved in the phosphorylation of tumor suppressor protein Rb. The CDK4 activity associated with this cyclin was reported to be necessary for cell cycle progression through G2 phase into mitosis after UV radiation. Several transcript variants encoding different isoforms have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "CDKN1B": "Gene Symbol CDKN1B This gene encodes a cyclin-dependent kinase inhibitor, which shares a limited similarity with CDK inhibitor CDKN1A/p21. The encoded protein binds to and prevents the activation of cyclin E-CDK2 or cyclin D-CDK4 complexes, and thus controls the cell cycle progression at G1. The degradation of this protein, which is triggered by its CDK dependent phosphorylation and subsequent ubiquitination by SCF complexes, is required for the cellular transition from quiescence to the proliferative state. Mutations in this gene are associated with multiple endocrine neoplasia type IV (MEN4).\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "CEP55": "Gene Symbol CEP55 Enables identical protein binding activity. Involved in cranial skeletal system development; establishment of protein localization; and midbody abscission. Acts upstream of or within mitotic cytokinesis. Located in Flemming body; centriolar satellite; and plasma membrane. Implicated in multinucleated neurons, anhydramnios, renal dysplasia, cerebellar hypoplasia and hydranencephaly.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "CITED1": "Gene Symbol CITED1 This gene encodes a member of the CREB-binding protein/p300-interacting transactivator with Asp/Glu-rich C-terminal domain (CITED) family of proteins. The encoded protein, also known as melanocyte-specific gene 1, may function as a transcriptional coactivator and may play a role in pigmentation of melanocytes. Alternatively spliced transcript variants have been described.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "COL2A1": "Gene Symbol COL2A1 This gene encodes the alpha-1 chain of type II collagen, a fibrillar collagen found in cartilage and the vitreous humor of the eye. Mutations in this gene are associated with achondrogenesis, chondrodysplasia, early onset familial osteoarthritis, SED congenita, Langer-Saldino achondrogenesis, Kniest dysplasia, Stickler syndrome type I, and spondyloepimetaphyseal dysplasia Strudwick type. In addition, defects in processing chondrocalcin, a calcium binding protein that is the C-propeptide of this collagen molecule, are also associated with chondrodysplasia. There are two transcripts identified for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "COPB1": "Gene Symbol COPB1 This gene encodes a protein subunit of the coatomer complex associated with non-clathrin coated vesicles. The coatomer complex, also known as the coat protein complex 1, forms in the cytoplasm and is recruited to the Golgi by activated guanosine triphosphatases. Once at the Golgi membrane, the coatomer complex may assist in the movement of protein and lipid components back to the endoplasmic reticulum. Alternatively spliced transcript variants have been described.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "COPZ1": "Gene Symbol COPZ1 This gene encodes a subunit of the cytoplasmic coatamer protein complex, which is involved in autophagy and intracellular protein trafficking. The coatomer protein complex is comprised of seven subunits and functions as the coat protein of coat protein complex (COP)I-vesicles. Alternative splicing results in multiple transcript variants.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "CREB1": "Gene Symbol CREB1 This gene encodes a transcription factor that is a member of the leucine zipper family of DNA binding proteins. This protein binds as a homodimer to the cAMP-responsive element, an octameric palindrome. The protein is phosphorylated by several protein kinases, and induces transcription of genes in response to hormonal stimulation of the cAMP pathway. Alternate splicing of this gene results in several transcript variants encoding different isoforms.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "CSRNP1": "Gene Symbol CSRNP1 This gene encodes a protein that localizes to the nucleus and expression of this gene is induced in response to elevated levels of axin. The Wnt signalling pathway, which is negatively regulated by axin, is important in axis formation in early development and impaired regulation of this signalling pathway is often involved in tumors. A decreased level of expression of this gene in tumors compared to the level of expression in their corresponding normal tissues suggests that this gene product has a tumor suppressor function. Alternative splicing results in multiple transcript variants.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "DAD1": "Gene Symbol DAD1 DAD1, the defender against apoptotic cell death, was initially identified as a negative regulator of programmed cell death in the temperature sensitive tsBN7 cell line. The DAD1 protein disappeared in temperature-sensitive cells following a shift to the nonpermissive temperature, suggesting that loss of the DAD1 protein triggered apoptosis. DAD1 is believed to be a tightly associated subunit of oligosaccharyltransferase both in the intact membrane and in the purified enzyme, thus reflecting the essential nature of N-linked glycosylation in eukaryotes.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "DARS": "Gene Symbol DARS1 This gene encodes a member of a multienzyme complex that functions in mediating the attachment of amino acids to their cognate tRNAs. The encoded protein ligates L-aspartate to tRNA(Asp). Mutations in this gene have been found in patients showing hypomyelination with brainstem and spinal cord involvement and leg spasticity. Alternative splicing results in multiple transcript variants.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "DDRGK1": "Gene Symbol DDRGK1 The protein encoded by this gene interacts with components of the ubiquitin fold modifier 1 conjugation pathway and helps prevent apoptosis in ER-stressed secretory tissues. In addition, the encoded protein regulates nuclear factor-&#954;B activity.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "DNAJC19": "Gene Symbol DNAJC19 The protein encoded by this gene is thought to be part of a complex involved in the ATP-dependent transport of transit peptide-containing proteins from the inner cell membrane to the mitochondrial matrix. Defects in this gene are a cause of 3-methylglutaconic aciduria type 5 (MGA5), also known as dilated cardiomyopathy with ataxia (DCMA). Alternative splicing of this gene results in multiple transcript variants. Related pseudogenes have been identified on chromosomes 1, 2, 6, 10, 14 and 19.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "DUSP9": "Gene Symbol DUSP9 The protein encoded by this gene is a member of the dual specificity protein phosphatase subfamily. These phosphatases inactivate their target kinases by dephosphorylating both the phosphoserine/threonine and phosphotyrosine residues. They negatively regulate members of the mitogen-activated protein (MAP) kinase superfamily (MAPK/ERK, SAPK/JNK, p38), which is associated with cellular proliferation and differentiation. Different members of the family of dual specificity phosphatases show distinct substrate specificities for various MAP kinases, different tissue distribution and subcellular localization, and different modes of inducibility of their expression by extracellular stimuli. This gene product shows selectivity for members of the ERK family of MAP kinases and is localized to the cytoplasm and nucleus. Aberrant expression of this gene is associated with type 2 diabetes and cancer progression in several cell types. Alternate splicing results in multiple transcript variants.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "E2F4": "Gene Symbol E2F4 The protein encoded by this gene is a member of the E2F family of transcription factors. The E2F family plays a crucial role in the control of cell cycle and action of tumor suppressor proteins and is also a target of the transforming proteins of small DNA tumor viruses. The E2F proteins contain several evolutionally conserved domains found in most members of the family. These domains include a DNA binding domain, a dimerization domain which determines interaction with the differentiation regulated transcription factor proteins (DP), a transactivation domain enriched in acidic amino acids, and a tumor suppressor protein association domain which is embedded within the transactivation domain. This protein binds to all three of the tumor suppressor proteins pRB, p107 and p130, but with higher affinity to the last two. It plays an important role in the suppression of proliferation-associated genes, and its gene mutation and increased expression may be associated with human cancer.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "ECT2": "Gene Symbol ECT2 The protein encoded by this gene is a guanine nucleotide exchange factor and transforming protein that is related to Rho-specific exchange factors and yeast cell cycle regulators. The expression of this gene is elevated with the onset of DNA synthesis and remains elevated during G2 and M phases. In situ hybridization analysis showed that expression is at a high level in cells undergoing mitosis in regenerating liver. Thus, this protein is expressed in a cell cycle-dependent manner during liver regeneration, and is thought to have an important role in the regulation of cytokinesis. Several transcript variants encoding different isoforms have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "EIF2B2": "Gene Symbol EIF2B2 This gene encodes the beta subunit of eukaryotic initiation factor-2B (EIF2B). EIF2B is involved in protein synthesis and exchanges GDP and GTP for its activation and deactivation.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "EIF2S1": "Gene Symbol EIF2S1\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "ELF1": "Gene Symbol ELF1 This gene encodes an E26 transformation-specific related transcription factor. The encoded protein is primarily expressed in lymphoid cells and acts as both an enhancer and a repressor to regulate transcription of various genes. Alternative splicing results in multiple transcript variants.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "ELK1": "Gene Symbol ELK1 This gene is a member of the Ets family of transcription factors and of the ternary complex factor (TCF) subfamily. Proteins of the TCF subfamily form a ternary complex by binding to the the serum response factor and the serum response element in the promoter of the c-fos proto-oncogene. The protein encoded by this gene is a nuclear target for the ras-raf-MAPK signaling cascade. This gene produces multiple isoforms by using alternative translational start codons and by alternative splicing. Related pseudogenes have been identified on chromosomes 7 and 14.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "FARSB": "Gene Symbol FARSB This gene encodes a highly conserved enzyme that belongs to the aminoacyl-tRNA synthetase class IIc subfamily. This enzyme comprises the regulatory beta subunits that form a tetramer with two catalytic alpha subunits. In the presence of ATP, this tetramer is responsible for attaching L-phenylalanine to the terminal adenosine of the appropriate tRNA. A pseudogene located on chromosome 10 has been identified. Alternative splicing results in multiple transcript variants.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "FOXA1": "Gene Symbol FOXA1 This gene encodes a member of the forkhead class of DNA-binding proteins. These hepatocyte nuclear factors are transcriptional activators for liver-specific transcripts such as albumin and transthyretin, and they also interact with chromatin. Similar family members in mice have roles in the regulation of metabolism and in the differentiation of the pancreas and liver.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "FOXL2": "Gene Symbol FOXL2 This gene encodes a forkhead transcription factor. The protein contains a fork-head DNA-binding domain and may play a role in ovarian development and function. Expansion of a polyalanine repeat region and other mutations in this gene are a cause of blepharophimosis syndrome and premature ovarian failure 3.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "C3orf72": "Gene Symbol FOXL2NB Located in fibrillar center.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "FOXO4": "Gene Symbol FOXO4 This gene encodes a member of the O class of winged helix/forkhead transcription factor family. Proteins encoded by this class are regulated by factors involved in growth and differentiation indicating they play a role in these processes. A translocation involving this gene on chromosome X and the homolog of the Drosophila trithorax gene, encoding a DNA binding protein, located on chromosome 11 is associated with leukemia. Multiple transcript variants encoding different isoforms have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "GABPA": "Gene Symbol GABPA This gene encodes one of three GA-binding protein transcription factor subunits which functions as a DNA-binding subunit. Since this subunit shares identity with a subunit encoding the nuclear respiratory factor 2 gene, it is likely involved in activation of cytochrome oxidase expression and nuclear control of mitochondrial function. This subunit also shares identity with a subunit constituting the transcription factor E4TF1, responsible for expression of the adenovirus E4 gene. Because of its chromosomal localization and ability to form heterodimers with other polypeptides, this gene may play a role in the Down Syndrome phenotype. Two transcript variants encoding the same protein have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "GBF1": "Gene Symbol GBF1 This gene encodes a member of the Sec7 domain family. The encoded protein is a guanine nucleotide exchange factor that regulates the recruitment of proteins to membranes by mediating GDP to GTP exchange. The encoded protein is localized to the Golgi apparatus and plays a role in vesicular trafficking by activating ADP ribosylation factor 1. The encoded protein has also been identified as an important host factor for viral replication. Multiple transcript variants have been observed for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "GLB1L2": "Gene Symbol GLB1L2 Predicted to enable beta-galactosidase activity. Predicted to be involved in carbohydrate metabolic process. Predicted to be located in extracellular region. Predicted to be active in vacuole.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "GMPPB": "Gene Symbol GMPPB This gene is thought to encode a GDP-mannose pyrophosphorylase. The encoded protein catalyzes the conversion of mannose-1-phosphate and GTP to GDP-mannose, a reaction involved in the production of N-linked oligosaccharides. Alternatively spliced transcript variants encoding distinct isoforms have been described.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "GNPNAT1": "Gene Symbol GNPNAT1 Enables identical protein binding activity. Predicted to be involved in UDP-N-acetylglucosamine biosynthetic process. Predicted to act upstream of or within cellular response to leukemia inhibitory factor. Predicted to be located in late endosome. Predicted to be active in Golgi apparatus; endoplasmic reticulum; and endoplasmic reticulum-Golgi intermediate compartment.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "HARS": "Gene Symbol HARS1 Aminoacyl-tRNA synthetases are a class of enzymes that charge tRNAs with their cognate amino acids. The protein encoded by this gene is a cytoplasmic enzyme which belongs to the class II family of aminoacyl-tRNA synthetases. The enzyme is responsible for the synthesis of histidyl-transfer RNA, which is essential for the incorporation of histidine into proteins. The gene is located in a head-to-head orientation with HARSL on chromosome five, where the homologous genes share a bidirectional promoter. The gene product is a frequent target of autoantibodies in the human autoimmune disease polymyositis/dermatomyositis. Several transcript variants encoding different isoforms have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "HNF4A": "Gene Symbol HNF4A The protein encoded by this gene is a nuclear transcription factor which binds DNA as a homodimer. The encoded protein controls the expression of several genes, including hepatocyte nuclear factor 1 alpha, a transcription factor which regulates the expression of several hepatic genes. This gene may play a role in development of the liver, kidney, and intestines. Mutations in this gene have been associated with monogenic autosomal dominant non-insulin-dependent diabetes mellitus type I. Alternative splicing of this gene results in multiple transcript variants encoding several different isoforms.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "HOXA13": "Gene Symbol HOXA13 In vertebrates, the genes encoding the class of transcription factors called homeobox genes are found in clusters named A, B, C, and D on four separate chromosomes. Expression of these proteins is spatially and temporally regulated during embryonic development. This gene is part of the A cluster on chromosome 7 and encodes a DNA-binding transcription factor which may regulate gene expression, morphogenesis, and differentiation. Expansion of a polyalanine tract in the encoded protein can cause hand-foot-uterus syndrome, also known as hand-foot-genital syndrome.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "HOXB9": "Gene Symbol HOXB9 This gene is a member of the Abd-B homeobox family and encodes a protein with a homeobox DNA-binding domain. It is included in a cluster of homeobox B genes located on chromosome 17. The encoded nuclear protein functions as a sequence-specific transcription factor that is involved in cell proliferation and differentiation. Increased expression of this gene is associated with some cases of leukemia, prostate cancer and lung cancer.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "HOXC13": "Gene Symbol HOXC13 This gene belongs to the homeobox family of genes. The homeobox genes encode a highly conserved family of transcription factors that play an important role in morphogenesis in all multicellular organisms. Mammals possess four similar homeobox gene clusters, HOXA, HOXB, HOXC and HOXD, which are located on different chromosomes and consist of 9 to 11 genes arranged in tandem. This gene is one of several homeobox HOXC genes located in a cluster on chromosome 12. The product of this gene may play a role in the development of hair, nail, and filiform papilla.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "HSPA9": "Gene Symbol HSPA9 This gene encodes a member of the heat shock protein 70 gene family. The encoded protein is primarily localized to the mitochondria but is also found in the endoplasmic reticulum, plasma membrane and cytoplasmic vesicles. This protein is a heat-shock cognate protein. This protein plays a role in cell proliferation, stress response and maintenance of the mitochondria. A pseudogene of this gene is found on chromosome 2.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "HYOU1": "Gene Symbol HYOU1 The protein encoded by this gene belongs to the heat shock protein 70 family. This gene uses alternative transcription start sites. A cis-acting segment found in the 5' UTR is involved in stress-dependent induction, resulting in the accumulation of this protein in the endoplasmic reticulum (ER) under hypoxic conditions. The protein encoded by this gene is thought to play an important role in protein folding and secretion in the ER. Since suppression of the protein is associated with accelerated apoptosis, it is also suggested to have an important cytoprotective role in hypoxia-induced cellular perturbation. This protein has been shown to be up-regulated in tumors, especially in breast tumors, and thus it is associated with tumor invasiveness. This gene also has an alternative translation initiation site, resulting in a protein that lacks the N-terminal signal peptide. This signal peptide-lacking protein, which is only 3 amino acids shorter than the mature protein in the ER, is thought to have a housekeeping function in the cytosol. In rat, this protein localizes to both the ER by a carboxy-terminal peptide sequence and to mitochondria by an amino-terminal targeting signal. Alternative splicing results in multiple transcript variants.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "IDH3A": "Gene Symbol IDH3A Isocitrate dehydrogenases catalyze the oxidative decarboxylation of isocitrate to 2-oxoglutarate. These enzymes belong to two distinct subclasses, one of which utilizes NAD(+) as the electron acceptor and the other NADP(+). Five isocitrate dehydrogenases have been reported: three NAD(+)-dependent isocitrate dehydrogenases, which localize to the mitochondrial matrix, and two NADP(+)-dependent isocitrate dehydrogenases, one of which is mitochondrial and the other predominantly cytosolic. NAD(+)-dependent isocitrate dehydrogenases catalyze the allosterically regulated rate-limiting step of the tricarboxylic acid cycle. Each isozyme is a heterotetramer that is composed of two alpha subunits, one beta subunit, and one gamma subunit. The protein encoded by this gene is the alpha subunit of one isozyme of NAD(+)-dependent isocitrate dehydrogenase.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "IER3IP1": "Gene Symbol IER3IP1 This gene encodes a small protein that is localized to the endoplasmic reticulum (ER) and may play a role in the ER stress response by mediating cell differentiation and apoptosis. Transcription of this gene is regulated by tumor necrosis factor alpha and specificity protein 1 (Sp1). Mutations in this gene may play a role in microcephaly, epilepsy, and diabetes syndrome (MEDS), and a pseudogene of this gene is located on the long arm of chromosome 12.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "IGDCC3": "Gene Symbol IGDCC3 Predicted to act upstream of or within neuromuscular process controlling balance. Predicted to be integral component of plasma membrane.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "ISL2": "Gene Symbol ISL2 Enables sequence-specific double-stranded DNA binding activity. Predicted to be involved in axonogenesis; neuron fate specification; and regulation of transcription by RNA polymerase II. Predicted to act upstream of or within negative regulation of neuron differentiation and neuron differentiation. Predicted to be part of chromatin. Predicted to be active in nucleus.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "KIF18B": "Gene Symbol KIF18B Enables cytoskeletal motor activity and kinesin binding activity. Involved in microtubule depolymerization; mitotic cell cycle; and regulation of cell division. Located in cytosol; microtubule; and nuclear body.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "KLF1": "Gene Symbol KLF1 This gene encodes a hematopoietic-specific transcription factor that induces high-level expression of adult beta-globin and other erythroid genes. The zinc-finger protein binds to the DNA sequence CCACACCCT found in the beta hemoglobin promoter. Heterozygous loss-of-function mutations in this gene result in the dominant In(Lu) blood phenotype.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "KMT2A": "Gene Symbol KMT2A This gene encodes a transcriptional coactivator that plays an essential role in regulating gene expression during early development and hematopoiesis. The encoded protein contains multiple conserved functional domains. One of these domains, the SET domain, is responsible for its histone H3 lysine 4 (H3K4) methyltransferase activity which mediates chromatin modifications associated with epigenetic transcriptional activation. This protein is processed by the enzyme Taspase 1 into two fragments, MLL-C and MLL-N. These fragments reassociate and further assemble into different multiprotein complexes that regulate the transcription of specific target genes, including many of the HOX genes. Multiple chromosomal translocations involving this gene are the cause of certain acute lymphoid leukemias and acute myeloid leukemias. Alternate splicing results in multiple transcript variants.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "LHX1": "Gene Symbol LHX1 This gene encodes a member of a large protein family which contains the LIM domain, a unique cysteine-rich zinc-binding domain. The encoded protein is a transcription factor important for the development of the renal and urogenital systems. This gene is a candidate for Mayer-Rokitansky-Kuster-Hauser syndrome, a disorder characterized by anomalies in the female genital tract.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "MAML2": "Gene Symbol MAML2 The protein encoded by this gene is a member of the Mastermind-like family of proteins. All family members are proline and glutamine-rich, and contain a conserved basic domain that binds the ankyrin repeat domain of the intracellular domain of the Notch receptors (ICN1-4) in their N-terminus, and a transcriptional activation domain in their C-terminus. This protein binds to an extended groove that is formed by the interaction of CBF1, Suppressor of Hairless, LAG-1 (CSL) with ICN, and positively regulates Notch signaling. High levels of expression of this gene have been observed in several B cell-derived lymphomas. Translocations resulting in fusion proteins with both CRTC1 and CRTC3 have been implicated in the development of mucoepidermoid carcinomas, while a translocation event with CXCR4 has been linked with chronic lymphocytic leukemia (CLL). Copy number variation in the polyglutamine tract has been observed.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "MANF": "Gene Symbol MANF The protein encoded by this gene is localized in the endoplasmic reticulum (ER) and golgi, and is also secreted. Reducing expression of this gene increases susceptibility to ER stress-induced death and results in cell proliferation. Activity of this protein is important in promoting the survival of dopaminergic neurons. The presence of polymorphisms in the N-terminal arginine-rich region, including a specific mutation that changes an ATG start codon to AGG, have been reported in a variety of solid tumors; however, these polymorphisms were later shown to exist in normal tissues and are thus no longer thought to be tumor-related.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "MAP2K6": "Gene Symbol MAP2K6 This gene encodes a member of the dual specificity protein kinase family, which functions as a mitogen-activated protein (MAP) kinase kinase. MAP kinases, also known as extracellular signal-regulated kinases (ERKs), act as an integration point for multiple biochemical signals. This protein phosphorylates and activates p38 MAP kinase in response to inflammatory cytokines or environmental stress. As an essential component of p38 MAP kinase mediated signal transduction pathway, this gene is involved in many cellular processes such as stress induced cell cycle arrest, transcription activation and apoptosis.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "MARS": "Gene Symbol MARS1 This gene encodes a member of the class I family of aminoacyl-tRNA synthetases. These enzymes play a critical role in protein biosynthesis by charging tRNAs with their cognate amino acids. The encoded protein is a component of the multi-tRNA synthetase complex and catalyzes the ligation of methionine to tRNA molecules.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "ELMSAN1": "Gene Symbol MIDEAS Predicted to enable transcription corepressor activity. Predicted to be involved in histone deacetylation; negative regulation of transcription, DNA-templated; and regulation of transcription by RNA polymerase II. Located in nucleoplasm.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "MIDN": "Gene Symbol MIDN Predicted to enable kinase binding activity. Predicted to be involved in negative regulation of glucokinase activity and negative regulation of insulin secretion. Located in cytoplasm and nucleus.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "MRGBP": "Gene Symbol MRGBP Predicted to be involved in histone acetylation and regulation of transcription by RNA polymerase II. Located in nucleoplasm.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "MRPL39": "Gene Symbol MRPL39 Mammalian mitochondrial ribosomal proteins are encoded by nuclear genes and help in protein synthesis within the mitochondrion. Mitochondrial ribosomes (mitoribosomes) consist of a small 28S subunit and a large 39S subunit. They have an estimated 75% protein to rRNA composition compared to prokaryotic ribosomes, where this ratio is reversed. Another difference between mammalian mitoribosomes and prokaryotic ribosomes is that the latter contain a 5S rRNA. Among different species, the proteins comprising the mitoribosome differ greatly in sequence, and sometimes in biochemical properties, which prevents easy recognition by sequence homology. This gene encodes a 39S subunit protein. Two transcript variants encoding distinct isoforms have been described. A pseudogene corresponding to this gene is found on chromosome 5q.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "MTHFD1": "Gene Symbol MTHFD1 This gene encodes a protein that possesses three distinct enzymatic activities, 5,10-methylenetetrahydrofolate dehydrogenase, 5,10-methenyltetrahydrofolate cyclohydrolase and 10-formyltetrahydrofolate synthetase. Each of these activities catalyzes one of three sequential reactions in the interconversion of 1-carbon derivatives of tetrahydrofolate, which are substrates for methionine, thymidylate, and de novo purine syntheses. The trifunctional enzymatic activities are conferred by two major domains, an aminoterminal portion containing the dehydrogenase and cyclohydrolase activities and a larger synthetase domain.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "NCL": "Gene Symbol NCL Nucleolin (NCL), a eukaryotic nucleolar phosphoprotein, is involved in the synthesis and maturation of ribosomes. It is located mainly in dense fibrillar regions of the nucleolus. Human NCL gene consists of 14 exons with 13 introns and spans approximately 11kb. The intron 11 of the NCL gene encodes a small nucleolar RNA, termed U20.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "NEDD8": "Gene Symbol NEDD8 Enables ubiquitin protein ligase binding activity. Acts upstream of or within protein neddylation. Located in cytosol and nucleoplasm. Biomarker of Parkinson's disease and malignant astrocytoma.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "NR2C2": "Gene Symbol NR2C2 This gene encodes a protein that belongs to the nuclear hormone receptor family. Members of this family act as ligand-activated transcription factors and function in many biological processes such as development, cellular differentiation and homeostasis. The activated receptor/ligand complex is translocated to the nucleus where it binds to hormone response elements of target genes. The protein encoded by this gene plays a role in protecting cells from oxidative stress and damage induced by ionizing radiation. The lack of a similar gene in mouse results in growth retardation, severe spinal curvature, subfertility, premature aging, and prostatic intraepithelial neoplasia (PIN) development. Alternative splicing results in multiple transcript variants encoding different isoforms.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "P4HB": "Gene Symbol P4HB This gene encodes the beta subunit of prolyl 4-hydroxylase, a highly abundant multifunctional enzyme that belongs to the protein disulfide isomerase family. When present as a tetramer consisting of two alpha and two beta subunits, this enzyme is involved in hydroxylation of prolyl residues in preprocollagen. This enzyme is also a disulfide isomerase containing two thioredoxin domains that catalyze the formation, breakage and rearrangement of disulfide bonds. Other known functions include its ability to act as a chaperone that inhibits aggregation of misfolded proteins in a concentration-dependent manner, its ability to bind thyroid hormone, its role in both the influx and efflux of S-nitrosothiol-bound nitric oxide, and its function as a subunit of the microsomal triglyceride transfer protein complex.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "POU3F2": "Gene Symbol POU3F2 This gene encodes a member of the POU-III class of neural transcription factors. The encoded protein is involved in neuronal differentiation and enhances the activation of corticotropin-releasing hormone regulated genes. Overexpression of this protein is associated with an increase in the proliferation of melanoma cells.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "PPWD1": "Gene Symbol PPWD1 Enables cyclosporin A binding activity and peptidyl-prolyl cis-trans isomerase activity. Involved in protein peptidyl-prolyl isomerization. Located in nuclear body. Part of catalytic step 2 spliceosome.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "SLMO2": "Gene Symbol PRELID3B Predicted to enable phosphatidic acid transfer activity. Predicted to be involved in phospholipid transport. Predicted to be active in mitochondrial intermembrane space.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "PRTG": "Gene Symbol PRTG This gene encodes a member of the immunoglobulin superfamily. The encoded transmembrane protein has been associated with the development of various tissues, especially neurogenesis. It has been suggested that this gene may be associated with attention deficit hyperactivity disorder (ADHD).\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "PTDSS1": "Gene Symbol PTDSS1 The protein encoded by this gene catalyzes the formation of phosphatidylserine from either phosphatidylcholine or phosphatidylethanolamine. Phosphatidylserine localizes to the mitochondria-associated membrane of the endoplasmic reticulum, where it serves a structural role as well as a signaling role. Defects in this gene are a cause of Lenz-Majewski hyperostotic dwarfism. Two transcript variants encoding different isoforms have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "PTPN1": "Gene Symbol PTPN1 The protein encoded by this gene is the founding member of the protein tyrosine phosphatase (PTP) family, which was isolated and identified based on its enzymatic activity and amino acid sequence. PTPs catalyze the hydrolysis of the phosphate monoesters specifically on tyrosine residues. Members of the PTP family share a highly conserved catalytic motif, which is essential for the catalytic activity. PTPs are known to be signaling molecules that regulate a variety of cellular processes including cell growth, differentiation, mitotic cycle, and oncogenic transformation. This PTP has been shown to act as a negative regulator of insulin signaling by dephosphorylating the phosphotryosine residues of insulin receptor kinase. This PTP was also reported to dephosphorylate epidermal growth factor receptor kinase, as well as JAK2 and TYK2 kinases, which implicated the role of this PTP in cell growth control, and cell response to interferon stimulation. Two transcript variants encoding different isoforms have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "PTPN12": "Gene Symbol PTPN12 The protein encoded by this gene is a member of the protein tyrosine phosphatase (PTP) family. PTPs are signaling molecules that regulate a variety of cellular processes including cell growth, differentiation, mitotic cycle, and oncogenic transformation. This PTP contains a C-terminal PEST motif, which serves as a protein-protein interaction domain, and may regulate protein intracellular half-life. This PTP was found to bind and dephosphorylate the product of the oncogene c-ABL and thus may play a role in oncogenesis. This PTP was also shown to interact with, and dephosphorylate, various products related to cytoskeletal structure and cell adhesion, such as p130 (Cas), CAKbeta/PTK2B, PSTPIP1, and paxillin. This suggests it has a regulatory role in controlling cell shape and mobility. Alternative splicing results in multiple transcript variants encoding distinct isoforms.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "PTPN13": "Gene Symbol PTPN13 The protein encoded by this gene is a member of the protein tyrosine phosphatase (PTP) family. PTPs are signaling molecules that regulate a variety of cellular processes including cell growth, differentiation, mitotic cycle, and oncogenic transformation. This PTP is a large intracellular protein. It has a catalytic PTP domain at its C-terminus and two major structural domains: a region with five PDZ domains and a FERM domain that binds to plasma membrane and cytoskeletal elements. This PTP was found to interact with, and dephosphorylate, Fas receptor and IkappaBalpha through the PDZ domains. This suggests it has a role in Fas mediated programmed cell death. This PTP was also shown to interact with GTPase-activating protein, and thus may function as a regulator of Rho signaling pathways. Four alternatively spliced transcript variants, which encode distinct proteins, have been reported.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "PTPN9": "Gene Symbol PTPN9 The protein encoded by this gene is a member of the protein tyrosine phosphatase (PTP) family. PTPs are known to be signaling molecules that regulate a variety of cellular processes including cell growth, differentiation, mitotic cycle, and oncogenic transformation. This PTP contains an N-terminal domain that shares a significant similarity with yeast SEC14, which is a protein that has phosphatidylinositol transfer activity and is required for protein secretion through the Golgi complex in yeast. This PTP was found to be activated by polyphosphoinositide, and is thought to be involved in signaling events regulating phagocytosis.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "QARS": "Gene Symbol QARS1 Aminoacyl-tRNA synthetases catalyze the aminoacylation of tRNA by their cognate amino acid. Because of their central role in linking amino acids with nucleotide triplets contained in tRNAs, aminoacyl-tRNA synthetases are thought to be among the first proteins that appeared in evolution. In metazoans, 9 aminoacyl-tRNA synthetases specific for glutamine (gln), glutamic acid (glu), and 7 other amino acids are associated within a multienzyme complex. Although present in eukaryotes, glutaminyl-tRNA synthetase (QARS) is absent from many prokaryotes, mitochondria, and chloroplasts, in which Gln-tRNA(Gln) is formed by transamidation of the misacylated Glu-tRNA(Gln). Glutaminyl-tRNA synthetase belongs to the class-I aminoacyl-tRNA synthetase family. Alternative splicing results in multiple transcript variants.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "RACGAP1": "Gene Symbol RACGAP1 This gene encodes a GTPase-activating protein (GAP) that is a compoment of the centralspindlin complex. This protein binds activated forms of Rho GTPases and stimulates GTP hydrolysis, which results in negative regulation of Rho-mediated signals. This protein plays a regulatory role in cytokinesis, cell growth, and differentiation. Alternatively spliced transcript variants have been found for this gene. There is a pseudogene for this gene on chromosome 12.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "RHOXF2BB": "Gene Symbol RHOXF2B Predicted to enable DNA-binding transcription factor activity, RNA polymerase II-specific and RNA polymerase II transcription regulatory region sequence-specific DNA binding activity. Involved in positive regulation of gene expression. Predicted to be located in nucleus. Predicted to be part of chromatin.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "RREB1": "Gene Symbol RREB1 The protein encoded by this gene is a zinc finger transcription factor that binds to RAS-responsive elements (RREs) of gene promoters. It has been shown that the calcitonin gene promoter contains an RRE and that the encoded protein binds there and increases expression of calcitonin, which may be involved in Ras/Raf-mediated cell differentiation. Multiple transcript variants encoding several different isoforms have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "S1PR2": "Gene Symbol S1PR2 This gene encodes a member of the G protein-coupled receptors, as well as the EDG family of proteins. The encoded protein is a receptor for sphingosine 1-phosphate, which participates in cell proliferation, survival, and transcriptional activation. Defects in this gene have been associated with congenital profound deafness.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "SAMD1": "Gene Symbol SAMD1 Predicted to enable chromatin binding activity and histone binding activity. Predicted to be involved in negative regulation of transcription, DNA-templated. Predicted to be located in cytoplasm and extracellular region. Predicted to be active in nucleus.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "SAMM50": "Gene Symbol SAMM50 This gene encodes a component of the Sorting and Assembly Machinery (SAM) of the mitochondrial outer membrane. The Sam complex functions in the assembly of beta-barrel proteins into the outer mitochondrial membrane.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "SCYL1": "Gene Symbol SCYL1 This gene encodes a transcriptional regulator belonging to the SCY1-like family of kinase-like proteins. The protein has a divergent N-terminal kinase domain that is thought to be catalytically inactive, and can bind specific DNA sequences through its C-terminal domain. It activates transcription of the telomerase reverse transcriptase and DNA polymerase beta genes. The protein has been localized to the nucleus, and also to the cytoplasm and centrosomes during mitosis. Multiple transcript variants encoding different isoforms have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "SEC61B": "Gene Symbol SEC61B The Sec61 complex is the central component of the protein translocation apparatus of the endoplasmic reticulum (ER) membrane. Oligomers of the Sec61 complex form a transmembrane channel where proteins are translocated across and integrated into the ER membrane. This complex consists of three membrane proteins- alpha, beta, and gamma. This gene encodes the beta-subunit protein. The Sec61 subunits are also observed in the post-ER compartment, suggesting that these proteins can escape the ER and recycle back. There is evidence for multiple polyadenylated sites for this transcript.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "SEC61G": "Gene Symbol SEC61G The Sec61 complex is the central component of the protein translocation apparatus of the endoplasmic reticulum (ER) membrane. Oligomers of the Sec61 complex form a transmembrane channel where proteins are translocated across and integrated into the ER membrane. This complex consists of three membrane proteins- alpha, beta, and gamma. This gene encodes the gamma-subunit protein. Alternatively spliced transcript variants encoding the same protein have been identified.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "SET": "Gene Symbol SET The protein encoded by this gene inhibits acetylation of nucleosomes, especially histone H4, by histone acetylases (HAT). This inhibition is most likely accomplished by masking histone lysines from being acetylated, and the consequence is to silence HAT-dependent transcription. The encoded protein is part of a complex localized to the endoplasmic reticulum but is found in the nucleus and inhibits apoptosis following attack by cytotoxic T lymphocytes. This protein can also enhance DNA replication of the adenovirus genome. Several transcript variants encoding different isoforms have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "SLC35B1": "Gene Symbol SLC35B1 This gene encodes a nucleotide sugar transporter which is a member of solute carrier family 35. The transporters in this family are highly conserved hydrophobic proteins with multiple transmembrane domains. Alternative splicing results in multiple transcript variants encoding different isoforms.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "SLC39A7": "Gene Symbol SLC39A7 The protein encoded by this gene transports zinc from the Golgi and endoplasmic reticulum to the cytoplasm. This transport may be important for activation of tyrosine kinases, some of which could be involved in cancer progression. Therefore, modulation of the encoded protein could be useful as a therapeutic agent against cancer. Alternative splicing results in multiple transcript variants.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "SPCS2": "Gene Symbol SPCS2 Predicted to enable peptidase activity. Predicted to be involved in protein targeting to ER and signal peptide processing. Predicted to be located in endoplasmic reticulum membrane. Predicted to be part of signal peptidase complex.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "SPCS3": "Gene Symbol SPCS3 Predicted to enable peptidase activity. Involved in proteolysis and viral protein processing. Located in endoplasmic reticulum.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "SRP68": "Gene Symbol SRP68 This gene encodes a subunit of the signal recognition particle (SRP). The SRP is a ribonucleoprotein complex that transports secreted and membrane proteins to the endoplasmic reticulum for processing. The complex includes a 7S RNA and six protein subunits. The encoded protein is the 68kDa component of the SRP, and forms a heterodimer with the 72kDa subunit that is required for SRP function. Alternatively spliced transcript variants encoding multiple isoforms have been observed for this gene, and three pseudogenes of this gene are located within the Smith-Magenis syndrome region on chromosome 17.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "SRP72": "Gene Symbol SRP72 This gene encodes the 72 kDa subunit of the signal recognition particle (SRP), a ribonucleoprotein complex that mediates the targeting of secretory proteins to the endoplasmic reticulum (ER). The SRP complex consists of a 7S RNA and 6 protein subunits: SRP9, SRP14, SRP19, SRP54, SRP68, and SRP72, that are bound to the 7S RNA as monomers or heterodimers. SRP has at least 3 distinct functions that can be associated with the protein subunits: signal recognition, translational arrest, and ER membrane targeting by interaction with the docking protein. Mutations in this gene are associated with familial bone marrow failure. Alternatively spliced transcript variants encoding different isoforms have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "SRPR": "Gene Symbol SRPRA The gene encodes a subunit of the endoplasmic reticulum signal recognition particle receptor that, in conjunction with the signal recognition particle, is involved in the targeting and translocation of signal sequence tagged secretory and membrane proteins across the endoplasmic reticulum. Alternative splicing results in multiple transcript variants.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "SRPRB": "Gene Symbol SRPRB The protein encoded by this gene has similarity to mouse protein which is a subunit of the signal recognition particle receptor (SR). This subunit is a transmembrane GTPase belonging to the GTPase superfamily. It anchors alpha subunit, a peripheral membrane GTPase, to the ER membrane. SR is required for the cotranslational targeting of both secretory and membrane proteins to the ER membrane.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "STT3A": "Gene Symbol STT3A The protein encoded by this gene is a catalytic subunit of the N-oligosaccharyltransferase (OST) complex, which functions in the endoplasmic reticulum to transfer glycan chains to asparagine residues of target proteins. A separate complex containing a similar catalytic subunit with an overlapping function also exists. Multiple transcript variants encoding different isoforms have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "SYVN1": "Gene Symbol SYVN1 This gene encodes a protein involved in endoplasmic reticulum (ER)-associated degradation. The encoded protein removes unfolded proteins, accumulated during ER stress, by retrograde transport to the cytosol from the ER. This protein also uses the ubiquitin-proteasome system for additional degradation of unfolded proteins. Sequence analysis identified two transcript variants that encode different isoforms.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "TARS": "Gene Symbol TARS1 Aminoacyl-tRNA synthetases catalyze the aminoacylation of tRNA by their cognate amino acid. Because of their central role in linking amino acids with nucleotide triplets contained in tRNAs, aminoacyl-tRNA synthetases are thought to be among the first proteins that appeared in evolution. Threonyl-tRNA synthetase belongs to the class-II aminoacyl-tRNA synthetase family\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "TELO2": "Gene Symbol TELO2 This gene encodes a protein that functions as an S-phase checkpoint protein in the cell cycle. The protein may also play a role in DNA repair.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "TIMM23": "Gene Symbol TIMM23 The protein encoded by this gene is part of a complex located in the inner mitochondrial membrane that mediates the transport of transit peptide-containing proteins across the membrane. Multiple transcript variants, one protein-coding and others not protein-coding, have been found for this gene.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "TIMM44": "Gene Symbol TIMM44 This gene encodes a peripheral membrane protein associated with the mitochondrial inner membrane translocase, which functions in the import of proteins across the mitochondrial inner membrane and into the mitochondrial matrix. The encoded protein mediates binding of mitochondrial heat shock protein 70 to the translocase of inner mitochondrial membrane 23 (TIM23) complex. Expression of this gene is upregulated in kidney in a mouse model of diabetes. A mutation in this gene is associated with familial oncocytic thyroid carcinoma.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "TMED10": "Gene Symbol TMED10 This gene is a member of the EMP24/GP25L/p24 family and encodes a protein with a GOLD domain. This type I membrane protein is localized to the plasma membrane and golgi cisternae and is involved in vesicular protein trafficking. The protein is also a member of a heteromeric secretase complex and regulates the complex's gamma-secretase activity without affecting its epsilon-secretase activity. Mutations in this gene have been associated with early-onset familial Alzheimer's disease. This gene has a pseudogene on chromosome 8.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "TMEM167A": "Gene Symbol TMEM167A Involved in constitutive secretory pathway. Located in Golgi apparatus.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "TTI1": "Gene Symbol TTI1 Involved in regulation of TOR signaling. Located in cytoplasm. Part of TORC1 complex and TORC2 complex.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "UBASH3A": "Gene Symbol UBASH3A This gene encodes one of two family members belonging to the T-cell ubiquitin ligand (TULA) family. Both family members can negatively regulate T-cell signaling. This family member can facilitate growth factor withdrawal-induced apoptosis in T cells, which may occur via its interaction with AIF, an apoptosis-inducing factor. Alternative splicing of this gene results in multiple transcript variants.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "UFM1": "Gene Symbol UFM1\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "XRN1": "Gene Symbol XRN1 This gene encodes a member of the 5'-3' exonuclease family. The encoded protein may be involved in replication-dependent histone mRNA degradation, and interacts directly with the enhancer of mRNA-decapping protein 4. In addition to mRNA metabolism, a similar protein in yeast has been implicated in a variety of nuclear and cytoplasmic functions, including homologous recombination, meiosis, telomere maintenance, and microtubule assembly. Mutations in this gene are associated with osteosarcoma, suggesting that the encoded protein may also play a role in bone formation. Alternative splicing results in multiple transcript variants.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "YIPF5": "Gene Symbol YIPF5 Predicted to be involved in endoplasmic reticulum to Golgi vesicle-mediated transport; regulation of ER to Golgi vesicle-mediated transport; and vesicle fusion with Golgi apparatus. Located in Golgi apparatus; endoplasmic reticulum; and nucleoplasm.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "YY1": "Gene Symbol YY1 YY1 is a ubiquitously distributed transcription factor belonging to the GLI-Kruppel class of zinc finger proteins. The protein is involved in repressing and activating a diverse number of promoters. YY1 may direct histone deacetylases and histone acetyltransferases to a promoter in order to activate or repress the promoter, thus implicating histone modification in the function of YY1.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "ZBTB1": "Gene Symbol ZBTB1 Enables K63-linked polyubiquitin modification-dependent protein binding activity; protein heterodimerization activity; and protein homodimerization activity. Involved in several processes, including cellular response to UV; nucleobase-containing compound biosynthetic process; and protein homooligomerization. Located in centrosome; nuclear body; and nuclear membrane.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "ZBTB10": "Gene Symbol ZBTB10 Predicted to enable RNA polymerase II transcription regulatory region sequence-specific DNA binding activity. Predicted to be involved in regulation of transcription by RNA polymerase II. Located in nucleoplasm.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "ZC3HAV1": "Gene Symbol ZC3HAV1 This gene encodes a CCCH-type zinc finger protein. This antiviral protein inhibits viral replication by recruiting cellular RNA degradation machineries to degrade viral mRNAs. The encoded protein plays an important role in the innate immune response against multiple DNA and RNA viruses, including Ebola virus, HIV and SARS-CoV-2 (which causes COVID-19).\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research.", "ZNF318": "Gene Symbol ZNF318 Predicted to enable protein heterodimerization activity and protein homodimerization activity. Predicted to be involved in negative regulation of transcription, DNA-templated and positive regulation of transcription, DNA-templated. Located in cytosol and nucleoplasm.\nK-562 are lymphoblast cells isolated from the bone marrow of a 53-year-old chronic myelogenous leukemia patient. The K-562 cell line is widely used in immune system disorder and immunology research."}